#+TITLE: Clase 06 - Arquitectura MVC Web - HTTP + Diseño de Rutas
*** XGET - Pedir Headers/Cabeceras
    #+BEGIN_SRC shell :results raw
      # sabemos que este recurso con id=500 no existe
      # con -i obtenemos información de las cabeceras
      curl -i -XGET 'http://macowins-server.herokuapp.com/prendas/500'
    #+END_SRC

    #+RESULTS:
    HTTP/1.1 404 Not Found
    Server: Cowboy
    Connection: keep-alive
    X-Powered-By: Express
    Expires: -1
    Content-Type: text/html; charset=utf-8
    Content-Length: 0
    Etag: W/"0-2jmj7l5rSw0yVb/vlWAYkK/YBwk"
    Vary: Accept-Encoding
    Date: Sat, 23 Oct 2021 04:58:11 GMT
    Via: 1.1 vegur
*** XDELETE - Borrar un recurso
    #+BEGIN_SRC shell :results raw
      curl  -XDELETE 'http://macowins-server.herokuapp.com/prendas/2'
    #+END_SRC

    #+RESULTS:
    {}
